app/controllers/books_controller.rb

  def create
    if @book = Book.create(book_params)
---
INSERT INTO "books" ("author", "content", "title") VALUES ($1, $2, $3) RETURNING "id"

  def update
    @book = Book.find(params[:id])
    if @book.update_attributes(book_params)
---
SELECT  "books".* FROM "books"  WHERE "books"."id" = $1 LIMIT 1  [["id", 4]]
UPDATE "books" SET "title" = $1 WHERE "books"."id" = 4  [["title", "Second Book"]]

  def destroy
    @book = Book.find(params[:id])
    @book.destroy!
---
SELECT  "books".* FROM "books"  WHERE "books"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "books" WHERE "books"."id" = $1  [["id", 1]]